Revit 2027 API
BuiltInFailures.SketchFailures.BeamDirectionNotSpecifiedError Property
 Beam direction not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BeamDirectionNotSpecifiedError { get; }
Public Shared ReadOnly Property BeamDirectionNotSpecifiedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BeamDirectionNotSpecifiedError {
	FailureDefinitionId^ get ();
}
static member BeamDirectionNotSpecifiedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace